docs: Cleanup READMe and add mermaid diagram
